In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('penguins_size.csv')

In [3]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [5]:
df.shape

(344, 7)

In [7]:
# Remove sex column
df = df.drop('sex', axis=1)

In [8]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0
3,Adelie,Torgersen,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0

In [9]:
df = df.dropna(subset=['culmen_length_mm', 'culmen_depth_mm', 'flipper_length_mm', 'body_mass_g'])

In [10]:
df.shape

(342, 6)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 342 entries, 0 to 343
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            342 non-null    object
 1   island             342 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
dtypes: float64(4), object(2)
memory usage: 18.7+ KB

In [12]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le = LabelEncoder()
df['island_id'] = le.fit_transform(df['island'])

In [16]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,island_id
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,2
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,2
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,2
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,2
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,2

In [17]:
df['island_id'].unique()

array([2, 0, 1])

In [18]:
df['species_id'] = le.fit_transform(df['species'])

In [19]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,island_id,species_id
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,2,0
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,2,0
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,2,0
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,2,0
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,2,0

In [20]:
df['species_id'].unique()

array([0, 1, 2])